Revit 2027 API
Truss.RemoveProfile Method
Remove the profile of a truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveProfile()
Public Sub RemoveProfile
public:
void RemoveProfile()
member RemoveProfile : unit -> unit
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace